/*А що таке досконалість? – спитав Олексій, засмучений черговим «баном» його
задачі за погане оформлення.
- Поняття досконалості, - відповів йому Ярослав, - було введено піфагорійцями ще
в VI столітті до нашої ери. Згідно їх нумерологічної містики, співпадання числа з
сумою своїх дільників (крім самого числа) свідчило про його досконалість.
Наприклад, числа 6 (1+2+3) або 28 (1+2+4+7+14) є досконалими.
- Вау! – вигукнув Борис. – А таких чисел багато?
- Не знаю. Та в мене є програма, яка може перевірити число на цю властивість.
Давайте свої числа і ми їх перевіримо.*/


#include <iostream>
#include <bits/stdc++.h>
using namespace std;


bool perfect(int N)
{
    int sum = 1;

    if (N < 2) return false;

    for (int i = 2; i*i <= N; i++)
    {
        if (N % i == 0) sum=sum+i+N/i;
    }
    if (sum==N) return true;
    return false;
}


int main()
{
    int N, num, found;
    cin >> N; 
    found=false;
    for (int i = 0; i < N; i++)
    {
        cin >> num;
        if (perfect(num))
        {
            cout << num << " ";
            found=true;
        }
    }
    if (!found) 
        cout << "-1";
    return 0;
}